In [14]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year':[2001, 2002, 2001, 2003, 2000],
'pop':[1.5, 1.7, 3.6, 2.4, 2.9]
}
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2001  1.5
1    Ohio  2002  1.7
2    Ohio  2001  3.6
3  Nevada  2003  2.4
4  Nevada  2000  2.9

In [3]:
df2 = pd.DataFrame(data, columns=['pop', 'state', 'year'])
df2

   pop   state  year
0  1.5    Ohio  2001
1  1.7    Ohio  2002
2  3.6    Ohio  2001
3  2.4  Nevada  2003
4  2.9  Nevada  2000

In [4]:
df3 = pd.DataFrame(data, columns=['pop', 'state', 'year', 'debt'])
df3

   pop   state  year debt
0  1.5    Ohio  2001  NaN
1  1.7    Ohio  2002  NaN
2  3.6    Ohio  2001  NaN
3  2.4  Nevada  2003  NaN
4  2.9  Nevada  2000  NaN

In [5]:
df3['year']

0    2001
1    2002
2    2001
3    2003
4    2000
Name: year, dtype: int64

In [7]:
df3['debt'] = 16.6
df3

   pop   state  year  debt
0  1.5    Ohio  2001  16.6
1  1.7    Ohio  2002  16.6
2  3.6    Ohio  2001  16.6
3  2.4  Nevada  2003  16.6
4  2.9  Nevada  2000  16.6

In [8]:
pop = {'Nevada':{2003:2.4, 2000:2.9},
'Ohio':{2001:1.5, 2000:2.6, 2003:1.7}}
df4 = pd.DataFrame(pop)
df4

      Nevada  Ohio
2003     2.4   1.7
2000     2.9   2.6
2001     NaN   1.5

In [9]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], 
                index=['d', 'b', 'a', 'c'])
obj.reindex(['a', 'b', 'c', 'd', 'e'])

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [10]:
obj.reindex(['a', 'b', 'c', 'd', 'e'],fill_value=0.0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [12]:
obj2 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])


obj3 = obj2.reindex(range(6), method='ffill')
obj3

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [15]:
obj = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])
obj.drop(['c'])

a    0
b    1
d    3
e    4
dtype: int32

In [16]:
obj = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])

obj['b']

1

In [17]:
obj[2:4]

c    2
d    3
dtype: int32

In [18]:
obj['b':'d']

b    1
c    2
d    3
dtype: int32

In [19]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])
data['two']##选取指定行的数据

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [20]:
s1 = pd.Series([1.1, 3.4, 2.5, 5], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([3.2, 4.0, 8.2, 2], index=['a', 'c', 'd', 'e'])
s1 + s2

a     4.3
b     NaN
c     6.5
d    13.2
e     NaN
dtype: float64

In [21]:
df1 = pd.DataFrame(np.arange(9).reshape((3,3)),
                                  columns=list('bcd'),
                                  index=['Ohio','Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12).reshape((4, 3)),
                                  columns=list('bde'),
                                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [22]:
data = pd.DataFrame(np.random.randn(4, 3), columns=list('bcd'),
index=['Utah', 'Ohio', 'Texas', 'Oregon'])
data

               b         c         d
Utah    0.445457  0.716499 -0.289033
Ohio   -0.878166  0.419654  1.558926
Texas  -1.288286  1.003297  0.036803
Oregon -0.578614 -0.088220  0.855651

In [23]:
np.abs(data)#取绝对值

               b         c         d
Utah    0.445457  0.716499  0.289033
Ohio    0.878166  0.419654  1.558926
Texas   1.288286  1.003297  0.036803
Oregon  0.578614  0.088220  0.855651

In [24]:
f = lambda x:x.max() - x.min()

data.apply(f)

b    1.733743
c    1.091517
d    1.847959
dtype: float64

In [25]:
data.apply(f, axis=1)

Utah      1.005533
Ohio      2.437092
Texas     2.291582
Oregon    1.434265
dtype: float64

In [26]:
obj = pd.Series(range(4), index=['a', 'd', 'c', 'b'])
obj.sort_index()

a    0
b    3
c    2
d    1
dtype: int64

In [52]:
df = pd.DataFrame(np.arange(8).reshape(2, 4), index=['three', 'one'],
                 columns=['d', 'a', 'b', 'c'])
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [33]:
df.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [53]:
df.sort_index(axis=0,ascending=False)

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [54]:
frame=pd.DataFrame({'b':[3,4,5,2],'c':[4,3,2,5]})

In [55]:
frame

   b  c
0  3  4
1  4  3
2  5  2
3  2  5

In [57]:
frame.sort_values(by='b',ascending=False)

   b  c
2  5  2
1  4  3
0  3  4
3  2  5

In [58]:
#缺失值处理

In [61]:
str=pd.Series(['1','2','3',np.nan])

In [62]:
str

0      1
1      2
2      3
3    NaN
dtype: object

In [63]:
pd.isnull(str)

0    False
1    False
2    False
3     True
dtype: bool

In [64]:
pd.notnull(str)

0     True
1     True
2     True
3    False
dtype: bool

In [65]:
str.dropna()

0    1
1    2
2    3
dtype: object

In [70]:
str1=str.fillna('5')

In [71]:
str1

0    1
1    2
2    3
3    5
dtype: object

In [77]:
d1=pd.DataFrame([[1,2,3],[np.nan,69],[7,np.nan,5]],index=[0,1,2],columns=[0,1,2])

In [78]:
d1

     0     1    2
0  1.0   2.0  3.0
1  NaN  69.0  NaN
2  7.0   NaN  5.0

In [79]:
d1.dropna()

     0    1    2
0  1.0  2.0  3.0

In [80]:
d1.fillna(4)

     0     1    2
0  1.0   2.0  3.0
1  4.0  69.0  4.0
2  7.0   4.0  5.0

In [81]:
s=pd.DataFrame(data={
'产品名称':['电脑','手机','键盘','鼠标','手机','键盘','鼠标','电脑'],
'成交额':[4100,1000,100,100,800,200,50,3000],
'成交量':[10,30,45,60,10,70,80,20]
})

In [82]:
s

  产品名称   成交额  成交量
0   电脑  4100   10
1   手机  1000   30
2   键盘   100   45
3   鼠标   100   60
4   手机   800   10
5   键盘   200   70
6   鼠标    50   80
7   电脑  3000   20

In [85]:


s.groupby('产品名称',as_index=False).sum()

  产品名称   成交额  成交量
0   手机  1800   40
1   电脑  7100   30
2   键盘   300  115
3   鼠标   150  140

In [92]:
s1=pd.DataFrame(data={
         '产品名称':['电脑','手机','键盘','鼠标','手机','键盘','鼠标','电脑'] ,
         '销售员':['张三','李四','张三','王五','李四','王五','王五','李四'],
         '成交额':[4100,1000,100,100,800,200,50,3000],
         '成交量':[10,30,45,60,10,70,80,20] })

In [93]:
s1

  产品名称 销售员   成交额  成交量
0   电脑  张三  4100   10
1   手机  李四  1000   30
2   键盘  张三   100   45
3   鼠标  王五   100   60
4   手机  李四   800   10
5   键盘  王五   200   70
6   鼠标  王五    50   80
7   电脑  李四  3000   20

In [94]:
s1.groupby(['产品名称','销售员'],as_index=False).sum()

  产品名称 销售员   成交额  成交量
0   手机  李四  1800   40
1   电脑  张三  4100   10
2   电脑  李四  3000   20
3   键盘  张三   100   45
4   键盘  王五   200   70
5   鼠标  王五   150  140

In [95]:
s.groupby('产品名称',as_index=False)['成交量'].sum()

  产品名称  成交量
0   手机   40
1   电脑   30
2   键盘  115
3   鼠标  140

In [96]:
import pandas as pd

s=pd.DataFrame(data={

'原数据':['1999.02.12','2003.03.30','2020.02.14','2020.10.25','1949.10.01']

})

In [97]:
s

          原数据
0  1999.02.12
1  2003.03.30
2  2020.02.14
3  2020.10.25
4  1949.10.01

In [98]:
s['日期']=pd.to_datetime(s['原数据'])
s['年']=s['日期'].dt.year
s['月']=s['日期'].dt.month
s['日']=s['日期'].dt.day
s['星期']=s['日期'].dt.day_name()
s['季度']=s['日期'].dt.quarter

In [100]:
s

          原数据         日期     年   月   日        星期  季度
0  1999.02.12 1999-02-12  1999   2  12    Friday   1
1  2003.03.30 2003-03-30  2003   3  30    Sunday   1
2  2020.02.14 2020-02-14  2020   2  14    Friday   1
3  2020.10.25 2020-10-25  2020  10  25    Sunday   4
4  1949.10.01 1949-10-01  1949  10   1  Saturday   4

In [101]:
 import pandas as pd
data=[[45,65,200],[89,69,42],[58,74,39]]
index=['张三','李四','王五']
col=['语文','数学','英语']
s=pd.DataFrame(data=data,index=index,columns=col)
s

    语文  数学   英语
张三  45  65  200
李四  89  69   42
王五  58  74   39

In [104]:
s.loc['李四':'王五','语文':'英语']

    语文  数学  英语
李四  89  69  42
王五  58  74  39